#### Terraform Plan 📝

**Environment:** `dev`
**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.lambda_assume: Reading...
aws_apigatewayv2_api.http: Refreshing state... [id=aa6eexr5lf]
aws_sqs_queue.dlq: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/022118847419/chainwatch-dev-jobs-dlq]
aws_cloudwatch_log_group.api_access: Refreshing state... [id=/aws/apigw/chainwatch-dev-http]
aws_cloudwatch_metric_alarm.refresh_marker_error: Refreshing state... [id=chainwatch-dev-refresh-marker-error]
aws_cloudwatch_metric_alarm.refresh_error_state: Refreshing state... [id=chainwatch-dev-refresh-error-state]
aws_dynamodb_table.assets: Refreshing state... [id=chainwatch_dev_assets]
aws_dynamodb_table.transactions: Refreshing state... [id=chainwatch_dev_transactions]
aws_dynamodb_table.config: Refreshing state... [id=chainwatch_dev_config]
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
aws_dynamodb_table.balances: Refreshing state... [id=chainwatch_dev_balances]
data.aws_caller_identity.current: Read complete after 0s [id=022118847419]
aws_cloudwatch_metric_alarm.worker_job_error: Refreshing state... [id=chainwatch-dev-worker-job-error]
aws_iam_role.lambda_role: Refreshing state... [id=chainwatch-dev-lambda-role]
aws_cloudwatch_log_resource_policy.apigw: Refreshing state... [id=chainwatch-dev-apigw-access-logs]
aws_sqs_queue.jobs: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/022118847419/chainwatch-dev-jobs]
aws_cloudwatch_metric_alarm.dlq_depth: Refreshing state... [id=chainwatch-dev-dlq-has-messages]
aws_apigatewayv2_stage.prod: Refreshing state... [id=$default]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=chainwatch-dev-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
data.aws_iam_policy_document.lambda_rw: Reading...
data.aws_iam_policy_document.lambda_rw: Read complete after 0s [id=2118188624]
aws_lambda_function.worker: Refreshing state... [id=chainwatch-dev-worker]
aws_lambda_function.read: Refreshing state... [id=chainwatch-dev-read]
aws_iam_policy.lambda_rw: Refreshing state... [id=arn:aws:iam::022118847419:policy/chainwatch-dev-lambda-rw]
aws_iam_role_policy_attachment.lambda_rw_attach: Refreshing state... [id=chainwatch-dev-lambda-role/arn:aws:iam::022118847419:policy/chainwatch-dev-lambda-rw]
aws_cloudwatch_log_group.lambda_worker: Refreshing state... [id=/aws/lambda/chainwatch-dev-worker]
aws_lambda_permission.worker_sqs_invoke: Refreshing state... [id=AllowSQSToInvokeWorker]
aws_cloudwatch_metric_alarm.worker_errors: Refreshing state... [id=chainwatch-dev-worker-errors]
aws_lambda_event_source_mapping.worker_sqs: Refreshing state... [id=3f662996-d5c9-485f-a312-34fcd5c859b7]
aws_lambda_permission.read_invoke: Refreshing state... [id=AllowAPIGatewayInvokeRead]
aws_cloudwatch_log_group.lambda_read: Refreshing state... [id=/aws/lambda/chainwatch-dev-read]
aws_apigatewayv2_integration.read: Refreshing state... [id=q2kdppf]
aws_apigatewayv2_route.get_recent_transactions: Refreshing state... [id=piaie3o]
aws_apigatewayv2_route.get_balances: Refreshing state... [id=yla1f33]
aws_apigatewayv2_route.get_assets: Refreshing state... [id=7po1mx2]
aws_apigatewayv2_route.get_root: Refreshing state... [id=e3ag9ja]
aws_apigatewayv2_route.get_top_holders: Refreshing state... [id=jnipz83]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.quota_update_error will be created
  + resource "aws_cloudwatch_metric_alarm" "quota_update_error" {
      + actions_enabled                       = true
      + alarm_description                     = "Helius quota state failed to update in DynamoDB"
      + alarm_name                            = "chainwatch-dev-helius-quota-update-error"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HeliusQuotaUpdateError"
      + namespace                             = "chainwatch/dev"
      + period                                = 300
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.worker_job_error_total will be created
  + resource "aws_cloudwatch_metric_alarm" "worker_job_error_total" {
      + actions_enabled                       = true
      + alarm_description                     = "Worker reported job execution errors (all job types)"
      + alarm_name                            = "chainwatch-dev-worker-job-error-total"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WorkerJobErrorTotal"
      + namespace                             = "chainwatch/dev"
      + period                                = 300
      + region                                = "us-west-2"
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_lambda_function.read will be updated in-place
  ~ resource "aws_lambda_function" "read" {
        id                             = "chainwatch-dev-read"
      ~ last_modified                  = "2025-11-05T07:01:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hr85yysAZfTODKqyL2nmwJTZgYx0bypYTxKV+ZZeCL8=" -> "+/ZGmvArgat8qfFympCGw0Iru6Dr8gXOl1fHoIUIQv0="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.worker will be updated in-place
  ~ resource "aws_lambda_function" "worker" {
        id                             = "chainwatch-dev-worker"
      ~ last_modified                  = "2025-11-05T07:01:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "LMeitXfJOJK4BzIZYG50LRlC5VuTglV1HvoOb0Z5KWw=" -> "JXURChr/DQiHnkeZCdVoLvGnYR9WTG57BLhpR6bhB0Q="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @atimics, Action: `pull_request`, Workflow: `Deploy Solana Monitor`*